taylor-an/STM32_Web_Snmp/HARDWARE/ETHERNET/lan8720.h
#ifndef __LAN8720_H
#define __LAN8720_H
#include "sys.h"
#include "stm32_eth.h"
#define LAN8720_PHY_ADDRESS  	0x01				//LAN8720 PHY芯片地址.
#define LAN8720_RST 		   	PDout(3) 			//LAN8720复位引脚	 

extern __align(4)  ETH_DMADESCTypeDef *DMARxDscrTab;			//以太网DMA接收描述符数据结构体指针
extern __align(4)  ETH_DMADESCTypeDef *DMATxDscrTab;			//以太网DMA发送描述符数据结构体指针 
extern __align(4) ETH_DMADESCTypeDef  *DMAPTPRxDscrTab;
extern __align(4) ETH_DMADESCTypeDef  *DMAPTPTxDscrTab;
extern __align(4)  uint8_t *Rx_Buff; 							//以太网底层驱动接收buffers指针 
extern __align(4)  uint8_t *Tx_Buff; 							//以太网底层驱动发送buffers指针
extern ETH_DMADESCTypeDef  *DMATxDescToSet;			//DMA发送描述符追踪指针
extern ETH_DMADESCTypeDef  *DMARxDescToGet; 		//DMA接收描述符追踪指针 
extern ETH_DMADESCTypeDef  *DMAPTPTxDescToSet;
extern ETH_DMADESCTypeDef  *DMAPTPRxDescToGet;

u8 LAN8720_Init(void);
u8 LAN8720_Get_Speed(void);
u8 ETH_MACDMA_Config(void);
FrameTypeDef ETH_Rx_Packet(void);
u8 ETH_Tx_Packet(u16 FrameLength);
u32 ETH_GetCurrentTxBuffer(void);
u8 ETH_Mem_Malloc(void);
void ETH_Mem_Free(void);
#endif 

